<a href="https://colab.research.google.com/github/straylight77/data-sci-learning/blob/master/titanic/titanic3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd

In [2]:
# https://www.kaggle.com/ldfreeman3/a-data-science-framework-to-achieve-99-accuracy#Step-1:-Define-the-Problem

data_raw = pd.read_csv('https://raw.githubusercontent.com/straylight77/data-sci-learning/master/titanic/train.csv')
data_val = pd.read_csv('https://raw.githubusercontent.com/straylight77/data-sci-learning/master/titanic/test.csv')

data1 = data_raw.copy(deep=True)
all_data = [data1, data_val]

data_raw.sample(10)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
647          648         1       1  ...  35.5000   A26         C
536          537         0       1  ...  26.5500   B38         S
102          103         0       1  ...  77.2875   D26         S
814          815         0       3  ...   8.0500   NaN         S
399          400         1       2  ...  12.6500   NaN         S
352          353         0       3  ...   7.2292   NaN         C
823          824         1       3  ...  12.4750  E121         S
277          278         0       2  ...   0.0000   NaN         S
799          800         0       3  ...  24.1500   NaN         S
781          782         1       1  ...  57.0000   B20         S

[10 rows x 12 columns]

In [3]:
# COMPLETE: fill in null values 
for ds in all_data:
    ds['Age'].fillna( ds['Age'].median(), inplace=True )
    ds['Embarked'].fillna( ds['Embarked'].mode()[0], inplace=True )
    ds['Fare'].fillna( ds['Fare'].median(), inplace=True )

drop_columns = ['PassengerId', 'Cabin', 'Ticket']
data1.drop(drop_columns, axis=1, inplace=True)

print(data1.isnull().sum())
print("-"*10)
print(data_val.isnull().sum())

Survived    0
Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64
----------
PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
dtype: int64

In [4]:
# CREATE: Feature Engineering 
for ds in all_data:
    ds['Relatives'] = ds['SibSp'] + ds['Parch']

    ds['IsAlone'] = ds['Relatives'].apply(lambda x: 0 if x > 0 else 1) 

    # qcut vs cut: https://stackoverflow.com/questions/30211923/what-is-the-difference-between-pandas-qcut-and-pandas-cut
    # https://pandas.pydata.org/pandas-docs/stable/generated/pandas.qcut.html
    ds['FareBin'] = pd.qcut(ds['Fare'], 4)
    
    # https://pandas.pydata.org/pandas-docs/stable/generated/pandas.cut.html
    ds['AgeBin'] = pd.cut(ds['Age'].astype(int), 5)

data1.sample(10)

     Survived  Pclass  ...          FareBin         AgeBin
527         0       1  ...  (31.0, 512.329]   (16.0, 32.0]
683         0       3  ...  (31.0, 512.329]  (-0.08, 16.0]
889         1       1  ...   (14.454, 31.0]   (16.0, 32.0]
210         0       3  ...   (-0.001, 7.91]   (16.0, 32.0]
744         1       3  ...   (7.91, 14.454]   (16.0, 32.0]
272         1       2  ...   (14.454, 31.0]   (32.0, 48.0]
752         0       3  ...   (7.91, 14.454]   (32.0, 48.0]
264         0       3  ...   (-0.001, 7.91]   (16.0, 32.0]
706         1       2  ...   (7.91, 14.454]   (32.0, 48.0]
764         0       3  ...   (-0.001, 7.91]  (-0.08, 16.0]

[10 rows x 13 columns]

In [5]:
# CONVERT: change to category types 
from sklearn import preprocessing

label = preprocessing.LabelEncoder()
for ds in all_data:    
    ds['Sex_Code'] = label.fit_transform(ds['Sex'])
    ds['Embarked_Code'] = label.fit_transform(ds['Embarked'])
    #ds['Title_Code'] = label.fit_transform(ds['Title'])
    ds['AgeBin_Code'] = label.fit_transform(ds['AgeBin'])
    ds['FareBin_Code'] = label.fit_transform(ds['FareBin'])

data1.sample(10)

     Survived  Pclass  ... AgeBin_Code FareBin_Code
753         0       3  ...           1            0
839         1       1  ...           1            2
324         0       3  ...           1            3
22          1       3  ...           0            1
443         1       2  ...           1            1
62          0       1  ...           2            3
846         0       3  ...           1            3
402         0       3  ...           1            1
454         0       3  ...           1            1
178         0       2  ...           1            1

[10 rows x 17 columns]